{
  "mentor_name": "Alex Hormozi",
  "platform": "YouTube",
  "date": "2025-06-12T16:43:01Z",
  "videoId": "i7bLRKwKSms",
  "title": "How I Would Build a Business in 2025 (If I Had to Start Over)",
  "description": "*Huge Announcement* 👉 My next book is here: $100M Money Models\nRegister free & get big free stuff here: https://register.acq.com\n\nI’m releasing it live at a virtual book launch event in 6 weeks, on Sat Aug 16.\nWhat you need to know:\nA good money model gets you more customers, to spend more money, in less time, over and over again\nBusinesses that have good money models beat businesses that don't - in every industry\nIf you don’t have one, the business will fail on a long enough time horizon\nIf you do, it gives you the one thing that keeps a business going: cash flow\n\n*What you’ll get for registering*→Access to 4 amazing free bonuses should you upgrade to VIP for the event (by just pre-ordering a copy of the book). The 4th bonus is absurd.\n\n*What you don’t know that’s going to happen at the live launch*→A lot. And you will like it. Expect fireworks.\n\nRegister here for free https://register.acq.com\n\nSee you there.\n\nPS - Every person who shows up live gets a secret project I’ve been working on for 2+ years. It's better than an NFT and less than a bitcoin. It is not a “free bonus” it is a paid product. But you will only get one - if you are there live.\n\nDISCLOSURE \nInformation shared here is for educational purposes only.  Individuals and business owners should evaluate their own business strategies, and identify any potential risks.  The information shared here is not a guarantee of success. Your results may vary.\nCopyright © 2025.",
  "transcript": "Transcript unavailable",
  "summary": "Summary unavailable - no transcript",
  "tags": [
    "Alex Hormozi",
    "Alex Hormozi Business Tips",
    "Alex Hormozi Gym Launch Secrets",
    "Hormozi",
    "Business guides",
    "Business tips",
    "Skillsets",
    "Skill Stacking",
    "The Game Podcast",
    "mozination",
    "100M Offers",
    "100M Leads"
  ],
  "url": "https://www.youtube.com/watch?v=i7bLRKwKSms",
  "statistics": {
    "viewCount": "437871",
    "likeCount": "13615",
    "favoriteCount": "0",
    "commentCount": "580"
  }
}